app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("cep", "street", "neighborhood", "city", "state", "country", "complement", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @address = Address.new(address_params)
    puts "*****************************"
    pp @address
    puts "*****************************"
    if @address.save