app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= super || User.find(@current_user_id)