app/controllers/products_controller.rb

  def index
    render json: Product.all
---
SELECT "products".* FROM "products"

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "image" = ?, "name" = ?, "price" = ?, "quantity" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "Foto 2"], ["name", "Brigadeiro"], ["price", "R$ 2,00"], ["quantity", "10 und."], ["description", "Aquele doce"], ["updated_at", "2022-07-06 00:42:43.598214"], ["id", 2]]

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("image", "name", "price", "quantity", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["image", "doce"], ["name", "docinho"], ["price", ""], ["quantity", ""], ["description", ""], ["created_at", "2022-07-06 00:33:11.344231"], ["updated_at", "2022-07-06 00:33:11.344231"]]